import React from 'react'

import MonoalphabetWidget from '../components/MonoalphabetWidget'
import MonoalphabetBreakWidget from '../components/MonoalphabetBreakWidget'
import katerineDialogImg from '../img/katherine_ferdinand.svg'
import {KEY_2, encipher} from '../ciphers/monoalphabet'
import { monoalphabetText } from './cipherTexts'


export default function ChapterOne() {
  return (
<article>
  <h2>Шифри одноалфавітної заміни</h2>
  <p className="main-text">
    Шифр Цезаря&nbsp;— це один із прикладів шифрів <em>одноалфавітної заміни</em>.
    Усі вони працюють за однаковим принципом&nbsp;— у відкритому тексті літери одного,
    нормального, алфавіту заміняються на відповідники з іншого, зміненого.
    Шифр Цезаря зручний тим, що новий секретний алфавіт у ньому будується на основі простого правила,
    а ключ короткий і його легко запам’ятати.
    А, в разі чого, і підібрати можна, що вже, звісно, погано.
    Багато одноалфавітних шифрів не мають ніякого правила побудови таблиці заміни&nbsp;— ключем є сама таблиця.
    Наприклад, для української абетки можна вибрати 33 символи і попарно протиставити їх 33 буквам.
    Існує <span className='msg-quote'>8683317618811886495518194401280000000</span> різних
    способів скласти такі пари.
    Через це то́му, хто намагається підбрати ключа простим перебором,
    не вистачило би і часу від початку Всесвіту.
    Здається, такий шифр вже точно мав би бути надійним.
  </p>

  <div className="command">
    <p className="command__phrase">
      Спробуй зашифрувати чи розшифрувати власні повідомлення. Для цього введи текст у відповідне поле.
    </p>
    <MonoalphabetWidget/>
  </div>

  <p className="main-text">
    У Європі 16 століття з її інтригами, секретними домовленостями,
    стратегічними шлюбами, змовами, вбивствами, зрадами й іншими справами, які потребували секретності,
    такого роду шифри були дуже популярними. Наприклад, в Англії однією з перших їх стала використовувати
    Катерина Арагонська. Вона була дочкою іспанських короля і королеви Фердинанда ІІ та Ізабелли І.
    Коли їй виповнилося 16, Катерину відіслали до Англії,
    де вона вийшла заміж за 14-річного королівського сина, але той наступного ж року помер.
    Молода вдова залишилася сама на чужині і ще шість років чекала на весілля з наступним принцом,
    хоч воно постійно відкладалося.
    У цей час вона самостійно вивчила шифр, який використовував іспанський посол для спілкування з її батьком,
    а згодом придумала власний. У 1509 Катеринин наречений зійшов на трон,
    став англійським королем Генріхом VIII і нарешті одружився з нею.
    Як королева Катерина використовувала свій шифр, щоби бути таємною посередницею у спілкуванні
    між двома монархами&nbsp;— своїм батьком і чоловіком.
    Листи Катерини до Фердинанда ІІ, між іншим, так і не розшифрували до 2018 року.
    Але причиною цього міг бути брак уваги зі сторони дослідників, а не складність її шифру.
  </p>
  <div className="command">
    {/* change this to png with text overlayed */}
    <object type="image/svg+xml" data={katerineDialogImg} width="800px"/>
  </div>
  <p className="main-text">
    Подивімося, як можна було би підійти до прочитання цих листів, якби вони потрапили тобі до рук.
    Ми вже з’ясували, що пробувати всі можливі варіанти ключів не вистачить життя,
    тому потрібна якась зачіпка&nbsp;— певна закономірність у використанні букв,
    яка могла би підказати шлях до злому шифру.
    Саме про таку річ знали арабські дослідники вже у 9 столітті&nbsp;— майже за 700 років до того,
    як Катерина Арагонська писала свої листи.
    Ці вчені надзвичайно серйозно ставилися до вивчення на всіх рівнях Корану, священної книги мусульман&nbsp;—
    не лише трактували його зміст, а й просто підраховували,
    яка буква скільки разів трапляється у сакральному тексті.
    Виявилося, що є поширеніші літери, а є більш рідкісні,
    і закономірність їх розподілу зберігається більш-менш стабільно для різних текстів.
    Арабський полімат Аль-Кінді здогадався використати цей факт, аби знаходити ключі до зашифрованих повідомлень.
    Про це він написав книжку «Манускрипт про дефшифрування криптографічних листів»,
    де описав метод, який ми зараз звемо <em>частотним криптоаналізом</em>.
  </p>
  <p className="main-text">
    Для частотного аналізу слід знати, якою мовою написаний текст.
    Взяти досить великий зразок тексту цією мовою і підрахувати у ньому всі букви.
    Далі зробити те ж із зашифрованим повідомленням.
    Маючи списки частоти символів в обидвох текстах можна почати заміняти
    найпоширеніші символи із шифротексту на найпоширеніші букви мови.
    Це рідко дає цілком правильний результат відразу,
    але частина букв стануть на свої місця і в шифротексті почнуть впізнаватися деякі слова,
    які можна використати, щоби виправляти помилки.
  </p>
  <p className="main-text">
    Спробуй зламати шифр наведеного нижче тексту.
    Частоту букв в українській мові можна оцінити на основі самої цієї статті.
    Адже, якщо є така можливість, то найліпше як зразок використовувати текст того ж автора,
    на ту ж тему, що й зашифроване повідомлення. Ось таблиця з підрахованими символами.
  </p>
  <div className="command">
    <p className="command__phrase">
      Спробуй зламати цей шифр. Верхній (зелений) рядок показує частоту символів у шифротексті,
      ти можеш наводити мишкою на будь-яку з букв, щоб побачити, де саме в тексті вона
      зустрічається. Нижній (блакитний) рядок покзаує поширення символів у тексті-зразку. Щоб замінити
      у шифротексті букву верхнього рядка на ту, що стоїть під нею, слід клацнути на кружечок між ними.
      Всі неактивовані символи нижнього рядка можна перетягувати мишкою з місця на місце.

      Якщо ти раптом застрягнеш і не знатимеш, що роботи, можеш скористатися підказками.
    </p>
    <MonoalphabetBreakWidget text={encipher(monoalphabetText, KEY_2)}/>
  </div>
</article>)
}