import React from 'react'


export default function ChapterOne() {
  return (
<article>
  <h2>Шифри одноалфавітної заміни</h2>
  <p className="main-text">
    Шифр Цезаря&nbsp;— це один із прикладів шифрів <em>одноалфавітної заміни</em>.
    Усі вони працюють за однаковим принципом&nbsp;— у відкритому тексті літери одного,
    нормального, алфавіту заміняються на відповідники з іншого, зміненого.
    Шифр Цезаря зручний тим, що новий секретний алфавіт у ньому будується на основі простого правила,
    а ключ короткий і його легко запам’ятати.
    А, в разі чого, і підібрати, що вже, звісно, погано.
    Багато одноалфавітних шифрів не мають ніякого правила побудови таблиці заміни&nbsp;— ключем є сама таблиця.
    Наприклад, для української абетки можна вибрати 33 символи і попарно протиставити їх 33 буквам.
    Існує <span className='msg-quote'>8683317618811886495518194401280000000</span> різних
    способів скласти такі пари.
    Через це тому, хто намагається підбрати ключа простим перебором,
    не вистачило би і часу від початку Всесвіту.
    Здається, такий шифр вже точно мав би бути надійним.
  </p>

ТАБЛИЧКА З СИМВОЛАМИ І ВІДЖЕТ ДЕ/ШИФРУВАННЯ

  <p className="main-text">
    У Європі 16 століття з її інтригами, секретними домовленостями,
    стратегічними шлюбами, змовами, вбивствами, зрадами й іншими справами, які потребували секретності,
    такого роду шифри були дуже популярними. Наприклад, в Англії однією з перших їх стала використовувати
    Катерина Арагонська. Вона була дочкою іспанських короля і королеви Фердинанда ІІ та Ізабелли І.
    Коли їй виповнилося 16, Катерину відіслали до Англії,
    де вона вийшла заміж за 14-річного королівського сина, але той наступного ж року помер.
    Молода вдова залишилася на чужині і ще шість років чекала на весілля з наступним принцом,
    хоч воно постійно відкладалося.
    У цей час вона самостійно вивчила шифр, який використовував іспанський посол для спілкування з її батьком,
    а згодом придумала власний. У 1509 Катеринин наречений зійшов на трон,
    став англійським королем Генріхом VIII і нарешті одружився з нею.
    Як королева Катерина використовувала свій шифр, щоби бути таємною посередницею у спілкуванні
    між двома монархами&nbsp;— своїм батьком і чоловіком.
    Листи Катерини до Фердинанда ІІ, між іншим, так і не розшифрували до 2018 року.
    Але причиною цього міг бути брак уваги зі сторони дослідників, а не складність її шифру.
  </p>
  <p className="main-text">
    Подивімося, як можна було би підійти до прочитання цих листів, якби вони потрапили тобі до рук.
    Ми вже з’ясували, що пробувати всі можливі варіанти ключів не вистачить життя,
    тому потрібна якась зачіпка&nbsp;— певна закономірність у використанні букв,
    яка могла би підказати шлях до злому шифру.
    Саме про таку річ знали арабські дослідники вже у 9 столітті&nbsp;— майже за 700 років до того,
    як Катерина Арагонська писала свої листи.
    Ці вчені надзвичайно серйозно ставилися до вивчення на всіх рівнях Корану, священної книги мусульман&nbsp;—
    не лише трактували його зміст, а й просто підраховували,
    яка буква скільки разів трапляється у сакральному тексті.
    Виявилося, що є поширеніші літери, а є більш рідкісні,
    і закономірність їх розподілу зберігається більш-менш стабільно для різних текстів.
    Арабський полімат Аль-Кінді здогадався використати цей факт, аби знаходити ключі до зашифрованих повідомлень.
    Про це він написав книжку «Манускрипт про дефшифрування криптографічних листів»,
    де описав метод, який ми зараз звемо <em>частотним криптоаналізом</em>.
  </p>
  <p className="main-text">
    Для частотного аналізу слід знати, якою мовою написаний текст.
    Взяти досить великий зразок тексту цією мовою і підрахувати у ньому всі букви.
    Далі зробити те ж із зашифрованим повідомленням.
    Маючи списки частоти символів в обидвох текстах можна почати заміняти
    найпоширеніші символи із шифротексту на найпоширеніші букви мови.
    Це рідко дає цілком правильний результат відразу,
    але частина букв стануть на свої місця і в шифротексті почнуть впізнаватися деякі слова,
    які можна використати, щоби виправляти помилки.
  </p>
  <p className="main-text">
    Спробуй зламати шифр наведеного нижче тексту.
    Частоту букв в українській мові можна оцінити на основі самої цієї статті.
    Адже, якщо є така можливість, то найліпше як зразок використовувати текст того ж автора,
    на ту ж тему, що й зашифроване повідомлення. Ось таблиця з підрахованими символами.
  </p>
(ТРЕБА ЩЕ Й ПІДРАХУВАТИ У ТЕКСТІ)

Далі ти можеш шукати ключ самостійно, або користуватися підказками.

Молодець, тепер ти криптоаналітик другого рівня.
Шифр, використаний для цього тексту, має ряд недоліків, яких можна було би легко позбутися.
Найпростіший спосіб трохи заплутати можливого зломника —
не використовувати у шифротексті пробілів і розділових знаків.
Так буде значно важче зрозуміти межі слів.
А шифрувальники Європи доби Відродження винайшли багато інших хитрощів —
впроваджувалися списки кодових слів чи символів, якими замінялися найважливіші поняття, наприклад,
назви міст, дат, операцій та імена людей.
Ключі шифрування доповнювалися «пустими» знаками, які нічого не означали,
шифрувальники просто писали їх час від часу поміж значущими символами,
щоб збити з пантелику зломників.
Для найпоширеніших букв в алфавіті придумували кілька різних замінників,
які треба було використовувати почергово,
аби не давати зачіпок для частотного аналізу.
Але кожна поважна держава мала своїх криптоаналітиків,
які знову і знову зламували найважливіші шифри ворогів, та й союзників.
У цей час кілька гарно освічених любителів винайшли чудовий новий спосіб засекречення,
який довго вважався цілком незламним, аж поки його не зламали.
Поліалфавіт — слово-ключ до наступного розділу.
</article>)
}