export const caesarText = `
Твоя криптографічна атака виявилася успішною!
Ти тепер криптоаналітик першого рівня
і можеш легко зламати найпростіші шифри, такі як Цезарів.
Може, ти думаєш, що наскільки простесенькі методи
ні для чого серйозного вже ніхто не використовує.
Але це не так, люди можуть робити дуже серйозні справи дуже по-дурному.
Наприклад, дві тисячі одинадцятого року у Британії один чоловік планував теракт
і йому треба було секретно переписуватися зі спільниками.
Він дещо знав про криптографію, але не довіряв жодним сучасним методам,
бо вони, на його думку, занадто добре всім відомі.
Тому він «винайшов» власний спосіб — шифр Цезаря в ексель документі.
Зайве казати, що всю його переписку перехопили і легко зламали,
теракт попередили, а його самого посадили до тюрми.
Якби всі поганці покладалися у своїх лихих планах на найпростіші шифри,
боротьба зі злочинністю була би значно простішою.
Далі ми говоритимемо про просунутіші алгоритми,
тому не повідомляй ніяким потенційним терористам ключового слова одноалфавіт,
яке дасть тобі доступ до наступного розділу.`